# Homework - SQL2

In [ ]:
%load_ext sql

In [ ]:
!pip install pymysql

Requirement already satisfied: pymysql in /usr/local/lib/python3.6/dist-packages (0.10.1)

### Use your host, id, password, and database

In [ ]:
import getpass
user = 'ethan'
password = getpass.getpass()
host='ethandb.ckskfpkvntpc.us-east-1.rds.amazonaws.com'
database = ''
connection_string = f'mysql+pymysql://{user}:{password}@{host}:3306/{database}'
    
%sql $connection_string

··········

'Connected: ethan@'

## Warning: Your companydb state MUST be clean as initial state

- Refer to jupyter notebook on "SQL Lab on AWS RDS"

### When you list the name of employees, the name must be the following format:

- Output Schema and tuple format:

```
+------------------+
| Employee name    |
+------------------+
| John B. Smith    |
...
+------------------+
```

- Use MySQL concat 함수 사용, Refer to MySQL manual or  Googling

In [ ]:
#concatanation! truncate

In [ ]:
%sql show databases

 * mysql+pymysql://ethan:***@ethandb.ckskfpkvntpc.us-east-1.rds.amazonaws.com:3306/
6 rows affected.

[('companydb',),
 ('information_schema',),
 ('mysql',),
 ('performance_schema',),
 ('sys',),
 ('univdb',)]

In [ ]:
%sql use companydb

 * mysql+pymysql://ethan:***@ethandb.ckskfpkvntpc.us-east-1.rds.amazonaws.com:3306/
0 rows affected.

[]

In [ ]:
%sql show tables;

 * mysql+pymysql://ethan:***@ethandb.ckskfpkvntpc.us-east-1.rds.amazonaws.com:3306/
6 rows affected.

[('DEPARTMENT',),
 ('DEPENDENT',),
 ('DEPT_LOCATIONS',),
 ('EMPLOYEE',),
 ('PROJECT',),
 ('WORKS_ON',)]

### 1-13번에 대해 SQL select 문을 작성하고 MySQL에서 실행한 결과물을 제출하시오.

#### 1. Retrieve the names of employees in department 5 who work more than 10 hours per week on the 'ProductX' project. (single SELECT 사용, MySQL concat 함수 사용)

In [ ]:
# %sql select * from EMPLOYEE

In [ ]:
%%sql     10
-- YOUR CODE HERE
select CONCAT(e.Fname, " ",e.Minit, ". ",e.Lname) as "Employee name"
from EMPLOYEE e, WORKS_ON w, PROJECT p
where e.dno=5 and p.pname='ProductX' and w.hours>=10 and p.pnumber=w.pno and w.essn=e.ssn

 * mysql+pymysql://ethan:***@ethandb.ckskfpkvntpc.us-east-1.rds.amazonaws.com:3306/
2 rows affected.

[('John B. Smith',), ('Joyce A. English',)]


#### 2.  List the names of employees who have a dependent with the same sex as themselves. (EXISTS 사용)

In [ ]:
# %sql select * from DEPENDENT

In [ ]:
%%sql     10
-- YOUR CODE HERE
select CONCAT(e.Fname, " ",e.Minit, ". ",e.Lname) as "Employee name"
from EMPLOYEE e
where exists (
    select *
    from DEPENDENT d
    where d.essn=e.ssn and e.sex=d.sex
)

 * mysql+pymysql://ethan:***@ethandb.ckskfpkvntpc.us-east-1.rds.amazonaws.com:3306/
2 rows affected.

[('John B. Smith',), ('Franklin T. Wong',)]

#### 3.  Find the names of employees that are directly supervised by 'Franklin Wong'. (EXISTS 사용)

In [ ]:
%%sql     10
-- YOUR CODE HERE
select CONCAT(e.Fname, " ",e.Minit, ". ",e.Lname) as "Employee name"
from EMPLOYEE e
where exists (
    select *
    from EMPLOYEE s
    where e.Superssn=s.ssn and s.fname="Franklin" and s.lname="Wong"
)

 * mysql+pymysql://ethan:***@ethandb.ckskfpkvntpc.us-east-1.rds.amazonaws.com:3306/
3 rows affected.

[('John B. Smith',), ('Joyce A. English',), ('Ramesh K. Narayan',)]

#### 4.  For each project, list the project name and the total hours per week (by all employees) spent on that project.
Output Schema:
```
+-----------------+-------------+
| Project name    | Total hours |
+-----------------+-------------+
```

In [ ]:
%%sql     10
-- YOUR CODE HERE
select pname as "Project name",sum(hours) as "Total hours"
from (WORKS_ON join PROJECT on pno=pnumber)
group by pno

 * mysql+pymysql://ethan:***@ethandb.ckskfpkvntpc.us-east-1.rds.amazonaws.com:3306/
6 rows affected.

[('Computerization', Decimal('55.0')),
 ('Newbenefits', Decimal('55.0')),
 ('ProductX', Decimal('52.5')),
 ('ProductY', Decimal('37.5')),
 ('ProductZ', Decimal('50.0')),
 ('Reorganization', Decimal('25.0'))]

#### 5.  Retrieve the names of employees who work on every project managed by 'Administration' department.

In [ ]:
%%sql     10
-- YOUR CODE HERE
select CONCAT(e.Fname, " ",e.Minit, ". ",e.Lname) as "Employee name"
from EMPLOYEE e
where not exists(
    select *
    from PROJECT p, DEPARTMENT d
    where d.dnumber=p.dnum and d.dname="Administration" and
    not exists(
        select *
        from WORKS_ON w
        where e.ssn=w.essn and
        p.pnumber=w.pno))

 * mysql+pymysql://ethan:***@ethandb.ckskfpkvntpc.us-east-1.rds.amazonaws.com:3306/
2 rows affected.

[('Ahmad V. Jabbar',), ('Alicia J. Zelaya',)]

#### 6.  Retrieve the names of employees who do not work on any project which is located in 'Houston'. (NOT EXISTS 사용)

In [ ]:
%%sql     10
-- YOUR CODE HERE
select CONCAT(e.Fname, " ",e.Minit, ". ",e.Lname) as "Employee name"
from EMPLOYEE e
where not exists(
    select *
    from PROJECT p, WORKS_ON wo
    where p.plocation = "Houston" and wo.pno=p.pnumber and wo.essn=e.ssn
)

 * mysql+pymysql://ethan:***@ethandb.ckskfpkvntpc.us-east-1.rds.amazonaws.com:3306/
4 rows affected.

[('John B. Smith',),
 ('Joyce A. English',),
 ('Ahmad V. Jabbar',),
 ('Alicia J. Zelaya',)]

#### 7.  For each department, retrieve the department name, and the average salary of employees working in that department.(소수점 이하 2자리까지만 출력, Refer to MySQL manual or  Googling)

Output schema
```
+-----------------+----------------+
| Department name | Average salary |
+-----------------+----------------+
```

In [ ]:
%%sql     10
-- YOUR CODE HERE
select dname as "Department name",round(avg(salary),2) as "Average salary"
from EMPLOYEE join DEPARTMENT on dno=dnumber
group by dno

 * mysql+pymysql://ethan:***@ethandb.ckskfpkvntpc.us-east-1.rds.amazonaws.com:3306/
3 rows affected.

[('Administration', Decimal('31000.00')),
 ('Headquarters', Decimal('55000.00')),
 ('Research', Decimal('33250.00'))]

#### 8.  Retrieve the average salary of all female employees. (소수점 이하 2자리까지만 출력, Refer to MySQL manual or  Googling)
Output Schema:
```
+----------------+
| Average salary |
+----------------+
```

In [ ]:
%%sql     10
-- YOUR CODE HERE
select round(avg(salary),2) as "Average salary"
from EMPLOYEE
where sex='F'

 * mysql+pymysql://ethan:***@ethandb.ckskfpkvntpc.us-east-1.rds.amazonaws.com:3306/
1 rows affected.

[(Decimal('31000.00'),)]

#### 9.  Find the names and addresses of employees who work on at least one project located in Houston but whose department has no location in Houston. (EXISTS, NOT EXISTS 사용)

Output schema:

```
+---------------------+-------------------------+
| Employee name       | Address                 |
+---------------------+-------------------------+
```

In [ ]:
#Adress
%%sql     10
-- YOUR CODE HERE
select CONCAT(e.Fname, " ",e.Minit, ". ",e.Lname) as "Employee name", e.address as "Address"
from EMPLOYEE e
where exists(
    select *
    from PROJECT p, DEPT_LOCATIONS dl, WORKS_ON wo
    where dl.dlocation = "Houston" and dl.dnumber=p.dnum and wo.pno=p.pnumber and wo.essn=e.ssn
) and not exists(
    select *
    from DEPT_LOCATIONS dl
    where e.dno=dl.dnumber and dl.dlocation = "Houston"
)

 * mysql+pymysql://ethan:***@ethandb.ckskfpkvntpc.us-east-1.rds.amazonaws.com:3306/
1 rows affected.

[('Jennifer S. Wallace', '291-Berry-Bellaire-TX')]

#### 10.  List the names of department managers who have no dependents. (EXISTS, NOT EXISTS 사용)

In [ ]:
%%sql     10
-- YOUR CODE HERE
select CONCAT(Fname, " ",Minit, ". ",Lname) as "Employee name"
from EMPLOYEE
where not exists (select *
              from DEPENDENT
              where ssn=Essn)
and exists (
    select *
    from DEPARTMENT
    where ssn=Mgrssn
);

 * mysql+pymysql://ethan:***@ethandb.ckskfpkvntpc.us-east-1.rds.amazonaws.com:3306/
1 rows affected.

[('James E. Borg',)]

#### 11. Retrieve the names of all employees who work in the department that has the employee with the highest salary among all employees.

In [ ]:
%%sql     10
-- YOUR CODE HERE
select CONCAT(e.Fname, " ",e.Minit, ". ",e.Lname) as "Employee name"
from EMPLOYEE e, EMPLOYEE top
where e.dno=top.dno and not exists(
    select *
    from EMPLOYEE low
    where top.salary<low.salary
)

 * mysql+pymysql://ethan:***@ethandb.ckskfpkvntpc.us-east-1.rds.amazonaws.com:3306/
1 rows affected.

[('James E. Borg',)]

#### 12-1. Retrieve the names of all employees whose supervisor’s supervisor is James Borg. (EXISTS 안에 EXISTS 사용)

In [ ]:
%%sql     10
-- YOUR CODE HERE
select CONCAT(e.Fname, " ",e.Minit, ". ",e.Lname) as "Employee name"
from EMPLOYEE e
where exists(
    select *
    from EMPLOYEE s
    where s.ssn=e.superssn and exists(
        select *
        from EMPLOYEE ss
        where ss.fname="James" and ss.lname="Borg" and ss.ssn=s.superssn
    )
)

 * mysql+pymysql://ethan:***@ethandb.ckskfpkvntpc.us-east-1.rds.amazonaws.com:3306/
5 rows affected.

[('John B. Smith',),
 ('Joyce A. English',),
 ('Ramesh K. Narayan',),
 ('Ahmad V. Jabbar',),
 ('Alicia J. Zelaya',)]

#### 12-2. Retrieve the names of all employees whose supervisor’s supervisor is James Borg. (single SELECT 사용)

In [ ]:
%%sql
-- YOUR CODE HERE
select CONCAT(SS.Fname, " ",SS.Minit, ". ",SS.Lname) as "Employee name"
from EMPLOYEE AS S, EMPLOYEE AS B, EMPLOYEE AS SS
where B.Lname="Borg" AND B.Fname="James" AND S.Superssn=B.Ssn AND S.ssn=SS.Superssn

 * mysql+pymysql://ethan:***@ethandb.ckskfpkvntpc.us-east-1.rds.amazonaws.com:3306/
5 rows affected.

[('John B. Smith',),
 ('Joyce A. English',),
 ('Ramesh K. Narayan',),
 ('Ahmad V. Jabbar',),
 ('Alicia J. Zelaya',)]

#### 13. Retrieve the names of employees who make at least 10,000 dollars more than the employee who is paid the least in the company.

In [ ]:
%%sql     10
-- YOUR CODE HERE
select CONCAT(e.Fname, " ",e.Minit, ". ",e.Lname) as "Employee name"
from EMPLOYEE e
where e.salary>(10000+(select min(salary) from EMPLOYEE))

 * mysql+pymysql://ethan:***@ethandb.ckskfpkvntpc.us-east-1.rds.amazonaws.com:3306/
4 rows affected.

[('Franklin T. Wong',),
 ('Ramesh K. Narayan',),
 ('James E. Borg',),
 ('Jennifer S. Wallace',)]

### 14-17번에 대해 SQL view문을 작성하고 MySQL에서 “select * from <view_name>”을 실행한 결과물을 제출하시오.

#### 14. A view that has the department name, manager name, and manager salary for every department

In [ ]:
# %sql drop view DEPT_VIEW;

 * mysql+pymysql://ethan:***@ethandb.ckskfpkvntpc.us-east-1.rds.amazonaws.com:3306/
0 rows affected.

[]

In [ ]:
%%sql     10
-- YOUR CODE HERE
create view DEPT_VIEW
as
select d.dname as "Department name", CONCAT(e.Fname, " ",e.Minit, ". ",e.Lname) as "Manager name", e.salary as "Manager salary"
from EMPLOYEE e, DEPARTMENT d
where d.mgrssn=e.ssn

 * mysql+pymysql://ethan:***@ethandb.ckskfpkvntpc.us-east-1.rds.amazonaws.com:3306/
0 rows affected.

[]

In [ ]:
%sql select * from DEPT_VIEW;

 * mysql+pymysql://ethan:***@ethandb.ckskfpkvntpc.us-east-1.rds.amazonaws.com:3306/
3 rows affected.

[('Headquarters', 'James E. Borg', Decimal('55000.00')),
 ('Administration', 'Jennifer S. Wallace', Decimal('43000.00')),
 ('Research', 'Franklin T. Wong', Decimal('40000.00'))]

#### 15. A view that has the employee name, supervisor name, and employee salary for each employee who works in the ‘Research’ department

In [ ]:
# %sql drop view RESEARCH_DEPT_VIEW;

In [ ]:
%%sql     10
-- YOUR CODE HERE
create view RESEARCH_DEPT_VIEW
as
select CONCAT(e.Fname, " ",e.Minit, ". ",e.Lname) as "Employee name", CONCAT(s.Fname, " ",s.Minit, ". ",s.Lname) as "Supervisor name", e.salary
from EMPLOYEE e, DEPARTMENT d, EMPLOYEE s
where d.dname="Research" and d.dnumber=e.dno and e.superssn=s.ssn

 * mysql+pymysql://ethan:***@ethandb.ckskfpkvntpc.us-east-1.rds.amazonaws.com:3306/
0 rows affected.

[]

In [ ]:
%sql select * from RESEARCH_DEPT_VIEW;

 * mysql+pymysql://ethan:***@ethandb.ckskfpkvntpc.us-east-1.rds.amazonaws.com:3306/
4 rows affected.

[('John B. Smith', 'Franklin T. Wong', Decimal('30000.00')),
 ('Franklin T. Wong', 'James E. Borg', Decimal('40000.00')),
 ('Joyce A. English', 'Franklin T. Wong', Decimal('25000.00')),
 ('Ramesh K. Narayan', 'Franklin T. Wong', Decimal('38000.00'))]

#### 16. A view that has the project name, controlling department name, number of employees, and total hours worked per week on the project for each project

In [ ]:
# %sql drop view PROJECT_VIEW;

 * mysql+pymysql://ethan:***@ethandb.ckskfpkvntpc.us-east-1.rds.amazonaws.com:3306/
0 rows affected.

[]

In [ ]:
%%sql     10
-- YOUR CODE HERE
create view PROJECT_VIEW
as
select pname as"Project name", dname as "Department name", count(*) as "Number of employees", sum(hours) as "Total hours"
from (WORKS_ON join PROJECT on pno=pnumber), DEPARTMENT
where dnum=dnumber
group by pno

 * mysql+pymysql://ethan:***@ethandb.ckskfpkvntpc.us-east-1.rds.amazonaws.com:3306/
0 rows affected.

[]

In [ ]:
%sql select * from PROJECT_VIEW;

 * mysql+pymysql://ethan:***@ethandb.ckskfpkvntpc.us-east-1.rds.amazonaws.com:3306/
6 rows affected.

[('ProductX', 'Research', 2, Decimal('52.5')),
 ('ProductY', 'Research', 3, Decimal('37.5')),
 ('ProductZ', 'Research', 2, Decimal('50.0')),
 ('Computerization', 'Administration', 3, Decimal('55.0')),
 ('Reorganization', 'Headquarters', 3, Decimal('25.0')),
 ('Newbenefits', 'Administration', 3, Decimal('55.0'))]

#### 17. A view that has the project name, controlling department name, number of employees, and total hours worked per week on the project for each project with more than two employees working on it

In [ ]:
%%sql     10
-- YOUR CODE HERE
create view PROJECT_VIEW_GT2
as
select pname as"Project name", dname as "Department name", count(*) as "Number of employees", sum(hours) as "Total hours"
from (WORKS_ON join PROJECT on pno=pnumber), DEPARTMENT
where dnum=dnumber
group by pno
having count(*)>2

 * mysql+pymysql://ethan:***@ethandb.ckskfpkvntpc.us-east-1.rds.amazonaws.com:3306/
0 rows affected.

[]

In [ ]:
%sql select * from PROJECT_VIEW_GT2;

 * mysql+pymysql://ethan:***@ethandb.ckskfpkvntpc.us-east-1.rds.amazonaws.com:3306/
4 rows affected.

[('ProductY', 'Research', 3, Decimal('37.5')),
 ('Computerization', 'Administration', 3, Decimal('55.0')),
 ('Reorganization', 'Headquarters', 3, Decimal('25.0')),
 ('Newbenefits', 'Administration', 3, Decimal('55.0'))]

#### 18. EMPLOYEE 테이블의 salary의 변경사항이 있을 때 마다, 변경사항을 기록하는 테이블 salary_audit(ssn, before_salary, after_salary, u_datetime)을 만들고, update trigger를 사용하여 변경사항을 기록하시오. 5번 부서에 속하는 직원의 salary를 100% 상향 조정 후, “select * from salary_audit”를 통해 결과를 확인하시오. udatetime에는 수정이 실행된 DATETIME(SQL Datatype, 날짜와 시각)을 기록한다. 현재 시각값은 now() 함수를 통해 얻을 수 있다.

## Warning
- 18번 문제 Update 한 후에 1-17번 문제를 다시 풀면 다른 결과가 나올 수 있음
- 1-17번 문제는 반드시 companydb의 초기 상태에서 풀어야 함

In [ ]:
%%sql     20
-- YOUR CODE HERE for "create table ..."
create table salary_audit
(
    Ssn CHAR(9) NOT NULL,
    Before_salary DECIMAL(10, 2),
    After_salary DECIMAL(10, 2),
    U_datetime DATETIME
) ENGINE=InnoDB;

 * mysql+pymysql://ethan:***@ethandb.ckskfpkvntpc.us-east-1.rds.amazonaws.com:3306/
0 rows affected.

[]

In [ ]:
%%sql
-- YOUR CODE HERE for "create trigger ..."
create trigger salary_update after update on EMPLOYEE
for each row
begin
if (old.salary!=new.salary)
then insert into salary_audit
values (new.ssn,old.salary,new.salary,NOW());
end if;
end;

 * mysql+pymysql://ethan:***@ethandb.ckskfpkvntpc.us-east-1.rds.amazonaws.com:3306/
0 rows affected.

[]

In [ ]:
%sql select * from salary_audit;

 * mysql+pymysql://ethan:***@ethandb.ckskfpkvntpc.us-east-1.rds.amazonaws.com:3306/
0 rows affected.

[]

In [ ]:
%sql update EMPLOYEE set salary = 2 * salary where dno = 5;

 * mysql+pymysql://ethan:***@ethandb.ckskfpkvntpc.us-east-1.rds.amazonaws.com:3306/
4 rows affected.

[]

In [ ]:
%sql select * from salary_audit;

 * mysql+pymysql://ethan:***@ethandb.ckskfpkvntpc.us-east-1.rds.amazonaws.com:3306/
4 rows affected.

[('123456789', Decimal('30000.00'), Decimal('60000.00'), datetime.datetime(2020, 12, 2, 12, 22, 30)),
 ('333445555', Decimal('40000.00'), Decimal('80000.00'), datetime.datetime(2020, 12, 2, 12, 22, 30)),
 ('453453453', Decimal('25000.00'), Decimal('50000.00'), datetime.datetime(2020, 12, 2, 12, 22, 30)),
 ('666884444', Decimal('38000.00'), Decimal('76000.00'), datetime.datetime(2020, 12, 2, 12, 22, 30))]